fillna() is used in PySpark to replace NULL or missing values in DataFrame columns.
- A single value to replace all NULLs
- A dictionary to specify different replacement values for different columns

In [1]:
# import SparkSession and Create Spark Session
from pyspark.sql import SparkSession, Row

spark = SparkSession.builder.appName("PySparkFillnaFunction").getOrCreate()

WARNING: Using incubator modules: jdk.incubator.vector
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
25/09/08 07:10:11 WARN Utils: Your hostname, KLZPC0015, resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/09/08 07:10:11 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/09/08 07:10:23 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
# create sample dataframes
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, None, 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", "null"),
    (5, "Arvind", 35000, "Business Data Analyst", 28),
    (6, "Prodipta", 25000, "Data Analyst", 28),
    (7, "Padma", 20000, "Data Analyst", None),
    (8, "Panta", 125000, "Business Analyst", 27),
    (9, "Sougato", None, None, 29)
]

columns = ["id", "name", "salary", "department", "age"]

df = spark.createDataFrame(data, schema=columns)
df.show()

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|                NULL|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|NULL|
|  8|    Panta|125000|    Business Analyst|  27|
|  9|  Sougato|  NULL|                NULL|  29|
+---+---------+------+--------------------+----+

In [3]:
# fillna() Example - Fill NULL values with a single value
print("Fill all NULLs with 'Unknown' for string columns and 0 for numeric columns: ")
df_fill_all = df.fillna("Unknown").fillna(0)
df_fill_all.show()

Fill all NULLs with 'Unknown' for string columns and 0 for numeric columns:

+---+---------+------+--------------------+-------+
| id|     name|salary|          department|    age|
+---+---------+------+--------------------+-------+
|  1|    Manta| 75000|                  IT|     24|
|  2| Dipankar| 30000|             Unknown|     27|
|  3|   Souvik| 60000|        Army Officer|     27|
|  4|Soukarjya| 45000|                 BDO|   null|
|  5|   Arvind| 35000|Business Data Ana...|     28|
|  6| Prodipta| 25000|        Data Analyst|     28|
|  7|    Padma| 20000|        Data Analyst|Unknown|
|  8|    Panta|125000|    Business Analyst|     27|
|  9|  Sougato|     0|             Unknown|     29|
+---+---------+------+--------------------+-------+

In [4]:
# fillna() Example - Fill NULL values by specifying column-specific values
print("Fill NULLs in 'department' with 'Unknown' and 'salary' with 0")

df_fill_columns = df.fillna(
    {
        "department": "Unknown",
        "salary": 0
    }
)
df_fill_columns.show()

Fill NULLs in 'department' with 'Unknown' and 'salary' with 0

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|             Unknown|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|NULL|
|  8|    Panta|125000|    Business Analyst|  27|
|  9|  Sougato|     0|             Unknown|  29|
+---+---------+------+--------------------+----+

In [5]:
# fillna() Example - Fill NULL values in a specific column only
print("Fill NULLs only in 'name' column with 'No Name': ")

df_fill_name = df.fillna("No Name", subset=["Name"])
df_fill_name.show()

Fill NULLs only in 'name' column with 'No Name':

+---+---------+------+--------------------+----+
| id|     name|salary|          department| age|
+---+---------+------+--------------------+----+
|  1|    Manta| 75000|                  IT|  24|
|  2| Dipankar| 30000|                NULL|  27|
|  3|   Souvik| 60000|        Army Officer|  27|
|  4|Soukarjya| 45000|                 BDO|null|
|  5|   Arvind| 35000|Business Data Ana...|  28|
|  6| Prodipta| 25000|        Data Analyst|  28|
|  7|    Padma| 20000|        Data Analyst|NULL|
|  8|    Panta|125000|    Business Analyst|  27|
|  9|  Sougato|  NULL|                NULL|  29|
+---+---------+------+--------------------+----+